var courseList = [
[
    // 高一
    [ // 1
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物']
    ],    
    [ // 2
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物'],
        ['语文', '数学', '物理', '化学', '政治', '历史', '地理', '生物']
    ]

],[
    // 高二

],[
    // 高三

]];

document.getElementById('loadImg').style="visibility:hidden;";
document.getElementById('loadTip').style="visibility:hidden;";
console.log("data Loaded.");