var courseList = [[
    /*高一*/
    
    [["语文","物理","地理","体育","数学","生物","校本","信息技术"],["数学","英语","化学","政治","语文","历史","班会","体锻"],["化学","英语","音乐","数学","物理","体育","校本","学科拓展课程"],["英语","语文","化学","美术","生物","数学","研究性学习","体锻"],["数学","政治","英语","语文","地理","物理","历史","体锻"]],
    [["语文","生物","历史","体育","美术","数学","校本","地理"],["英语","物理","政治","数学","语文","化学","班会","体锻"],["英语","化学","物理","历史","数学","体育","校本","学科拓展课程"],["语文","数学","英语","化学","地理","音乐","研究性学习","体锻"],["政治","数学","语文","英语","信息技术","物理","生物","体锻"]],
    [["化学","语文","政治","体育","英语","历史","校本","数学"],["英语","数学","生物","地理","物理","语文","班会","体锻"],["物理","英语","数学","信息技术","化学","体育","校本","学科拓展课程"],["生物","语文","美术","音乐","数学","历史","研究性学习","体锻"],["英语","数学","政治","语文","化学","地理","物理","体锻"]],
    [["生物","体育","化学","历史","数学","英语","校本","政治"],["英语","地理","数学","语文","音乐","物理","班会","体锻"],["英语","数学","历史","体育","语文","化学","校本","学科拓展课程"],["数学","生物","信息技术","语文","物理","地理","研究性学习","体锻"],["数学","英语","美术","语文","物理","政治","化学","体锻"]],
    [["化学","体育","物理","地理","英语","政治","校本","数学"],["生物","英语","语文","历史","美术","数学","班会","体锻"],["化学","英语","数学","体育","物理","语文","校本","学科拓展课程"],["数学","物理","语文","音乐","历史","生物","研究性学习","体锻"],["英语","语文","数学","政治","信息技术","化学","地理","体锻"]],
    [["语文","体育","化学","物理","数学","英语","校本","美术"],["数学","英语","地理","政治","历史","生物","班会","体锻"],["物理","英语","语文","体育","化学","数学","校本","学科拓展课程"],["生物","数学","信息技术","语文","化学","物理","研究性学习","体锻"],["数学","地理","英语","语文","音乐","历史","政治","体锻"]],
    [["物理","体育","语文","化学","英语","生物","校本","数学"],["历史","数学","政治","英语","地理","信息技术","班会","体锻"],["语文","物理","英语","体育","数学","化学","校本","学科拓展课程"],["语文","生物","物理","数学","美术","化学","研究性学习","体锻"],["英语","数学","语文","音乐","政治","地理","历史","体锻"]],
    [["物理","地理","体育","语文","数学","英语","校本","化学"],["英语","历史","生物","数学","语文","政治","班会","体锻"],["化学","英语","语文","物理","体育","数学","校本","学科拓展课程"],["数学","语文","生物","化学","政治","美术","研究性学习","体锻"],["地理","数学","音乐","英语","物理","历史","信息技术","体锻"]],
    [["化学","物理","语文","体育","英语","历史","校本","数学"],["生物","英语","数学","地理","政治","语文","班会","体锻"],["英语","物理","化学","语文","数学","体育","校本","学科拓展课程"],["语文","数学","化学","生物","音乐","政治","研究性学习","体锻"],["历史","英语","数学","美术","地理","信息技术","物理","体锻"]],
    [["语文","物理","体育","化学","英语","竞赛训练","校本","数学"],["英语","历史","生物","数学","美术","语文","班会","体锻"],["英语","化学","数学","物理","体育","竞赛训练","校本","学科拓展课程"],["语文","数学","音乐","信息技术","政治","竞赛训练","研究性学习","体锻"],["语文","数学","地理","英语","化学","物理","生物","体锻"]],
    [["语文","化学","体育","历史","物理","英语","校本","数学"],["地理","英语","数学","信息技术","生物","政治","班会","体锻"],["化学","语文","物理","英语","体育","数学","校本","学科拓展课程"],["数学","语文","音乐","生物","历史","美术","研究性学习","体锻"],["语文","地理","英语","数学","政治","化学","物理","体锻"]],
    [["政治","语文","体育","物理","数学","英语","校本","历史"],["化学","地理","英语","生物","数学","语文","班会","体锻"],["数学","英语","化学","音乐","体育","物理","校本","学科拓展课程"],["语文","数学","美术","化学","信息技术","地理","研究性学习","体锻"],["政治","英语","语文","数学","生物","物理","历史","体锻"]],
    [["语文","体育","地理","化学","物理","生物","校本","数学"],["历史","英语","政治","数学","音乐","语文","班会","体锻"],["物理","英语","数学","体育","化学","美术","校本","学科拓展课程"],["语文","信息技术","化学","英语","数学","物理","研究性学习","体锻"],["数学","英语","语文","地理","历史","生物","政治","体锻"]],
    [["物理","语文","体育","地理","数学","历史","校本","生物"],["英语","政治","数学","化学","语文","音乐","班会","体锻"],["数学","物理","美术","英语","体育","化学","校本","学科拓展课程"],["生物","语文","英语","信息技术","地理","数学","研究性学习","体锻"],["英语","数学","历史","语文","物理","政治","化学","体锻"]]],
    
    [
    /*高二*/
    
    [["语文","历史","美术","自习","数学","通用技术","英语","体锻"],["英语","政治","体育","数学","历史","自习","班会","学科拓展课程"],["生物","英语","历史","数学","政治","语文","自习","体锻"],["语文","通用技术","英语","体育","生物","数学","研究性学习","学科拓展课程"],["英语","政治","数学","语文","劳动","自习","历史","体锻"]],
    [["语文","地理","历史","通用技术","英语","数学","政治","体锻"],["数学","英语","自习","体育","地理","历史","班会","学科拓展课程"],["英语","数学","劳动","历史","语文","政治","美术","体锻"],["数学","英语","语文","政治","地理","体育","研究性学习","学科拓展课程"],["地理","英语","语文","数学","通用技术","历史","生物","体锻"]],
    [["地理","语文","通用技术","数学","历史","英语","政治","体锻"],["英语","体育","生物","历史","数学","地理","班会","学科拓展课程"],["政治","英语","数学","劳动","美术","地理","语文","体锻"],["英语","语文","数学","历史","体育","政治","研究性学习","学科拓展课程"],["英语","历史","语文","数学","地理","通用技术","自习","体锻"]],
    [["政治","语文","数学","生物","英语","物理","通用技术","体锻"],["物理","体育","化学","数学","英语","美术","班会","学科拓展课程"],["物理","化学","英语","语文","通用技术","政治","数学","体锻"],["英语","数学","化学","语文","体育","劳动","研究性学习","学科拓展课程"],["语文","政治","数学","英语","化学","物理","自习","体锻"]],
    [["语文","政治","地理","自习","数学","英语","历史","体锻"],["英语","体育","历史","生物","数学","地理","班会","学科拓展课程"],["数学","历史","语文","英语","政治","地理","通用技术","体锻"],["语文","英语","数学","美术","体育","自习","研究性学习","学科拓展课程"],["政治","数学","英语","地理","历史","语文","通用技术","体锻"]],
    [["语文","通用技术","物理","地理","英语","美术","数学","体锻"],["物理","体育","英语","政治","地理","数学","班会","学科拓展课程"],["英语","自习","生物","数学","劳动","语文","物理","体锻"],["英语","数学","语文","通用技术","体育","地理","研究性学习","学科拓展课程"],["英语","地理","语文","数学","政治","生物","物理","体锻"]],
    [["语文","物理","地理","通用技术","数学","美术","英语","体锻"],["生物","英语","数学","体育","地理","自习","班会","学科拓展课程"],["物理","英语","地理","语文","数学","通用技术","政治","体锻"],["数学","英语","语文","劳动","物理","体育","研究性学习","学科拓展课程"],["数学","语文","英语","政治","生物","地理","物理","体锻"]],
    [["物理","化学","语文","地理","英语","政治","数学","体锻"],["数学","英语","化学","体育","通用技术","地理","班会","学科拓展课程"],["化学","物理","英语","地理","生物","数学","语文","体锻"],["英语","语文","数学","物理","政治","体育","研究性学习","学科拓展课程"],["语文","数学","通用技术","英语","地理","物理","化学","体锻"]],
    [["化学","物理","政治","语文","数学","通用技术","英语","体锻"],["物理","生物","体育","化学","数学","英语","班会","学科拓展课程"],["数学","化学","物理","英语","语文","自习","音乐","体锻"],["语文","数学","英语","体育","美术","政治","研究性学习","学科拓展课程"],["数学","语文","英语","通用技术","化学","生物","物理","体锻"]],
    [["物理","语文","化学","数学","英语","生物","自习","体锻"],["数学","政治","英语","体育","化学","物理","班会","学科拓展课程"],["物理","英语","化学","美术","语文","通用技术","数学","体锻"],["生物","语文","英语","数学","政治","体育","研究性学习","学科拓展课程"],["英语","通用技术","数学","语文","物理","音乐","化学","体锻"]],
    [["语文","政治","数学","化学","通用技术","英语","物理","体锻"],["生物","数学","体育","英语","物理","化学","班会","学科拓展课程"],["英语","化学","政治","物理","数学","音乐","语文","体锻"],["英语","通用技术","数学","体育","生物","语文","研究性学习","学科拓展课程"],["数学","英语","语文","美术","化学","物理","自习","体锻"]],
    [["物理","语文","通用技术","化学","政治","数学","英语","体锻"],["地理","英语","体育","物理","生物","数学","班会","学科拓展课程"],["英语","数学","通用技术","语文","物理","化学","地理","体锻"],["数学","英语","化学","体育","语文","地理","研究性学习","学科拓展课程"],["英语","地理","数学","政治","化学","物理","语文","体锻"]],
    [["政治","物理","语文","美术","数学","英语","通用技术","体锻"],["英语","物理","体育","化学","生物","数学","班会","学科拓展课程"],["数学","英语","化学","政治","语文","物理","通用技术","体锻"],["语文","数学","英语","体育","化学","生物","研究性学习","学科拓展课程"],["数学","语文","英语","音乐","物理","化学","自习","体锻"]],
    [["物理","语文","化学","自习","英语","数学","生物","体锻"],["政治","英语","物理","体育","数学","通用技术","班会","学科拓展课程"],["英语","数学","语文","美术","音乐","物理","化学","体锻"],["数学","英语","通用技术","化学","语文","体育","研究性学习","学科拓展课程"],["语文","数学","政治","英语","生物","物理","化学","体锻"]]],
    
    [
    /*高三*/
    
    [["数学","语文","语文","历史","英语","政治","化学","班会"],["化学","英语","语文","政治","体育","历史","数学","数学训练"],["政治","英语","英语","化学","数学","语文","历史","体锻"],["英语","数学","数学","语文","政治","化学","历史","英语训练"],["数学","英语","历史","体育","语文","政治","化学","历史训练"]],
    [["英语","英语","地理","语文","化学","数学","历史","班会"],["英语","化学","历史","语文","地理","数学","体育","数学训练"],["数学","数学","化学","地理","语文","英语","历史","体锻"],["语文","语文","英语","数学","地理","历史","化学","英语训练"],["英语","数学","历史","体育","化学","地理","语文","历史训练"]],
    [["语文","语文","历史","地理","英语","政治","数学","班会"],["政治","英语","数学","语文","历史","地理","体育","数学训练"],["英语","英语","地理","政治","语文","数学","历史","体锻"],["语文","数学","数学","英语","历史","政治","地理","英语训练"],["数学","历史","语文","体育","英语","政治","地理","历史训练"]],
    [["数学","数学","英语","语文","生物","政治","物理","班会"],["物理","生物","政治","英语","语文","体育","数学","数学训练"],["英语","英语","生物","政治","数学","语文","物理","体锻"],["语文","语文","物理","英语","政治","数学","生物","英语训练"],["英语","体育","语文","数学","生物","物理","政治","物理训练"]],
    [["英语","数学","语文","语文","政治","地理","物理","班会"],["物理","政治","地理","语文","数学","体育","英语","数学训练"],["英语","英语","政治","地理","语文","物理","数学","体锻"],["数学","数学","物理","英语","地理","语文","政治","英语训练"],["语文","英语","体育","数学","政治","物理","地理","物理训练"]],
    [["数学","语文","英语","英语","地理","政治","物理","班会"],["政治","物理","地理","数学","英语","体育","语文","数学训练"],["数学","数学","地理","政治","英语","语文","物理","体锻"],["语文","语文","英语","物理","数学","政治","地理","英语训练"],["英语","数学","体育","语文","地理","政治","物理","物理训练"]],
    [["数学","数学","语文","化学","物理","英语","地理","班会"],["化学","物理","英语","地理","语文","数学","体育","数学训练"],["数学","地理","语文","语文","物理","英语","化学","体锻"],["化学","英语","英语","物理","语文","地理","数学","英语训练"],["英语","语文","体育","数学","物理","地理","化学","物理训练"]],
    [["英语","语文","语文","数学","物理","化学","地理","班会"],["物理","化学","英语","地理","体育","语文","数学","数学训练"],["化学","地理","数学","数学","语文","物理","英语","体锻"],["英语","英语","物理","语文","数学","地理","化学","英语训练"],["语文","体育","数学","英语","物理","地理","化学","物理训练"]],
    [["语文","物理","生物","化学","数学","英语","英语","班会"],["物理","英语","语文","数学","体育","化学","生物","数学训练"],["英语","化学","数学","数学","生物","语文","物理","体锻"],["语文","语文","生物","英语","数学","物理","化学","英语训练"],["英语","体育","数学","语文","物理","生物","化学","物理训练"]],
    [["语文","语文","化学","数学","英语","物理","生物","班会"],["英语","物理","生物","语文","体育","数学","化学","数学训练"],["化学","生物","数学","数学","物理","语文","英语","体锻"],["语文","英语","英语","物理","数学","化学","生物","英语训练"],["语文","英语","数学","体育","生物","化学","物理","物理训练"]],
    [["语文","语文","英语","物理","数学","生物","化学","班会"],["物理","数学","化学","生物","英语","体育","语文","数学训练"],["数学","数学","生物","英语","物理","化学","语文","体锻"],["语文","化学","英语","英语","生物","数学","物理","英语训练"],["数学","语文","英语","体育","化学","生物","物理","物理训练"]],
    [["英语","英语","物理","地理","语文","化学","数学","班会"],["化学","物理","语文","英语","数学","地理","体育","数学训练"],["语文","地理","数学","数学","化学","物理","英语","体锻"],["化学","语文","语文","英语","物理","数学","地理","英语训练"],["数学","体育","英语","语文","地理","物理","化学","物理训练"]],
    [["数学","数学","物理","生物","化学","英语","语文","班会"],["数学","物理","英语","化学","生物","语文","体育","数学训练"],["英语","英语","化学","数学","语文","生物","物理","体锻"],["生物","英语","语文","语文","化学","物理","数学","英语训练"],["语文","数学","体育","英语","物理","化学","生物","物理训练"]],
    [["物理","化学","地理","英语","数学","数学","语文","班会"],["英语","语文","数学","物理","化学","体育","地理","数学训练"],["英语","英语","化学","地理","数学","物理","语文","体锻"],["物理","英语","语文","语文","化学","地理","数学","英语训练"],["英语","语文","体育","数学","物理","地理","化学","物理训练"]]]];
    
    
document.getElementById('loadImg').style="visibility:hidden;";
document.getElementById('loadTip').style="visibility:hidden;";
console.log("data Loaded.");